var movieDataset = [
    {
        "name": "科幻",
        "next": [{ "name": "地心引力" }, { "name": "火星救援" }, { "name": "星球大战" }, { "name": "环太平洋" }, { "name": "头号玩家" }, { "name": "机器之血" },
            { "name": "复仇者联盟4" }, { "name": "美人鱼" }, { "name": "侏罗纪世界" }, { "name": "上海堡垒" }, { "name": "惊奇队长" }, { "name": "降临" }]
    },
    {
        "name": "恐怖",
        "next": [{ "name": "夜伴歌声" }, { "name": "妖铃铃" }, { "name": "午夜幽灵" }, { "name": "夺命五头鲨" }, { "name": "假戏真做" }, { "name": "午夜十二点" },
        { "name": "守灵" }, { "name": "惊魂七夜" }, { "name": "寂静之地" }, { "name": "看不见的小孩" }, { "name": "怨灵" }, { "name": "噬魂剑" }]
    },
    {
        "name": "爱情",
        "next": [{ "name": "少年的你" }, { "name": "悲伤逆流成河" }, { "name": "无问西东" }, { "name": "那些女人" }, { "name": "诛仙" }, { "name": "相亲时代" },
        { "name": "疯狂的麻将" }, { "name": "后来的我们" }, { "name": "羞羞的铁拳" }, { "name": "友情以上" }, { "name": "昼颜" }, { "name": "我们的爱情" }]
    },
	{
        "name": "剧情",
        "next": [{ "name": "攀登者" }, { "name": "中国机长" }, { "name": "动物世界" }, { "name": "悲伤逆流成河" }, { "name": "地久天长" }, { "name": "无问西东" },
            { "name": "小小的愿望" }, { "name": "烈火英雄" }, { "name": "银河补习班" }, { "name": "我不是药神" }, { "name": "暗语者" }, { "name": "建军大业" }]
    },
    {
        "name": "喜剧",
        "next": [{ "name": "捉妖记" }, { "name": "的士速递5" }, { "name": "奇葩朵朵" }, { "name": "西虹市首富" }, { "name": "大闹西游" }, { "name": "鼠胆英雄" },
        { "name": "翻滚吧姐妹" }, { "name": "乘风破浪" }, { "name": "无名之辈" }, { "name": "快把我哥带走" }, { "name": "爱情公寓" }, { "name": "闺蜜的战争" }]
    },
    {
        "name": "动作",
        "next": [{ "name": "动物世界" }, { "name": "狄仁杰之四大天王" }, { "name": "巨鳄风暴" }, { "name": "红海行动" }, { "name": "唐人街探案" }, { "name": "云南虫谷" },
        { "name": "非凡任务" }, { "name": "狂暴巨兽" }, { "name": "奇门遁甲" }, { "name": "决战食神" }, { "name": "高兴逮笨贼" }, { "name": "密战" }]
    },
	{
        "name": "犯罪",
        "next": [{ "name": "犯罪现场" }, { "name": "夺命杀机" }, { "name": "追龙" }, { "name": "冷血追击" }, { "name": "沉默的证人" }, { "name": "巨额来电" },
            { "name": "寒战" }, { "name": "调音师" }, { "name": "沉默的雪" }, { "name": "检察方的罪人" }, { "name": "罪途" }, { "name": "三人行" }]
    },
    {
        "name": "悬疑",
        "next": [{ "name": "少年宿舍" }, { "name": "密林鬼影" }, { "name": "心理罪之城市之光" }, { "name": "北斗风云" }, { "name": "邂逅未知" }, { "name": "摩天营救" },
        { "name": "嫌疑人X的献身" }, { "name": "策反" }, { "name": "壹号别墅" }, { "name": "推理笔记" }, { "name": "地球最后的夜晚" }, { "name": "保持沉默" }]
    },
    {
        "name": "战争",
        "next": [{ "name": "血战湘江" }, { "name": "空天猎" }, { "name": "战狼" }, { "name": "我的战争" }, { "name": "决战" }, { "name": "天将雄狮" },
        { "name": "铁甲战神" }, { "name": "士兵的荣耀" }, { "name": "国王的选择" }, { "name": "自由联盟" }, { "name": "风声" }, { "name": "黎明之眼" }]
    },
    {
        "name": "动画",
        "next": [{ "name": "哪吒之魔童降世" }, { "name": "恐龙王" }, { "name": "风语咒" }, { "name": "狮子王" }, { "name": "大闹天宫" }, { "name": "罗小黑战记" },
        { "name": "大侦探皮卡丘" }, { "name": "你的名字" }, { "name": "驯龙高手" }, { "name": "声之形" }, { "name": "赛车总动员" }, { "name": "夏目友人帐" }]
    },
    

];
var movieLastLevel = ['360p国语', '360p英语', '720p国语', '720p英语', '1080p国语', '1080p英语','2k英语','4k英语','导演剪辑版','4k无字幕','首映版本','1080p原版','720p完整版'];