var stockDataset = [
    {
        "name": "沪深个股",
        "next": [{ "name": "沪深A股" }, { "name": "上证A股" }, { "name": "深证A股" }, { "name": "新股" }, { "name": "中小板" }, { "name": "创业板" },
            { "name": "科创板" }, { "name": "沪股通" }, { "name": "深股通" }, { "name": "B股" }, { "name": "行业板" }, { "name": "地域板" }]
    },
    {
        "name": "港股市场",
        "next": [{ "name": "港股主板" }, { "name": "港股创业板" }, { "name": "知名港股" }, { "name": "蓝筹股" }, { "name": "红筹股" }, { "name": "红筹成分股" },
        { "name": "国企股" }, { "name": "国企成分股" }, { "name": "港股通" }, { "name": "恒生成分股" }, { "name": "AH股" }]
    },
    {
        "name": "美股市场",
        "next": [{ "name": "科技类" }, { "name": "医药类" }, { "name": "食品类" }, { "name": "重工业" }, { "name": "航天航空" }, { "name": "知名美股" },
        { "name": "媒体类" }, { "name": "汽车类" }, { "name": "零售业类" }, { "name": "制造业类" }, { "name": "能源类" }, { "name": "教育板块" }]
    },
    {
        "name": "期货市场",
        "next": [{ "name": "上期所" }, { "name": "上期能源" }, { "name": "大商所" }, { "name": "郑商所" }, { "name": "中金所" }, { "name": "港交所" },
        { "name": "国际期货" }, { "name": "金融期货" }, { "name": "能源化工" }, { "name": "金属钢材" }, { "name": "农业食品" }, { "name": "贵金属" }]
    },
    {
        "name": "外汇市场",
        "next": [{ "name": "美元" }, { "name": "日元" }, { "name": "欧元" }, { "name": "英镑" }, { "name": "离岸人民币" }, { "name": "卢布" },
        { "name": "比索" }, { "name": "港元" }, { "name": "韩元" }, { "name": "新币" }, { "name": "加元" }, { "name": "澳元" }]
    },
    {
        "name": "基金市场",
        "next": [{ "name": "封闭基金" }, { "name": "ETF基金" }, { "name": "LOF基金" }, { "name": "开放型基金" }, { "name": "指数基金" }, { "name": "货币基金" },
            { "name": "稳健基金" }, { "name": "沪市基金" }, { "name": "深市基金" }, { "name": "港市基金" }]
    },
    {
        "name": "投资组合",
        "next": [{ "name": "常胜组合" }, { "name": "稳健组合" }, { "name": "短线组合" }, { "name": "抓涨停组合" }, { "name": "高收益组合" }, { "name": "期货组合" },
        { "name": "货币组合" }, { "name": "长期组合" }, { "name": "创新高组合" }]
    },
    {
        "name": "全球股市",
        "next": [{ "name": "上证指数" }, { "name": "深证成指" }, { "name": "沪深300" }, { "name": "恒生指数" }, { "name": "英国富时" }, { "name": "法国CAC" },
        { "name": "德国DAX" }, { "name": "俄罗斯RTS" }, { "name": "纳斯达克" }, { "name": "标准普尔" }, { "name": "道琼斯指数" }, { "name": "日经225" }]
    },
    {
        "name": "期权市场",
        "next": [{ "name": "沪交所铜" }, { "name": "深交所铜" }, { "name": "港交所铜" }, { "name": "沪交所橡胶" }, { "name": "深交所玉米" }, { "name": "大交所煤矿" },
        { "name": "钢铁交易" }, { "name": "郑商所棉花" }, { "name": "大交所大豆" }, { "name": "豆粕交易" }, { "name": "白糖交易" }, { "name": "稀土交易" }]
    },
    {
        "name": "资金流向",
        "next": [{ "name": "大盘资金" }, { "name": "个股资金" }, { "name": "板块资金" }, { "name": "行业资金" }, { "name": "概念资金" }, { "name": "地域资金" },
            { "name": "科创资金" }, { "name": "沪深港通资金" }, { "name": "沪深港通流向" }]
    }

];
var stockLastLevel = ['今开','最高','涨停','换手','成交量','市盈','总市值','昨收','最低','跌停','量比','成交额','市净','流通市值'];