var facultyDataset = [
    {
        "name": "医学院",
        "next": [{ "name": "口腔医学" }, { "name": "骨科医学" }, { "name": "医学影像" }, { "name": "麻醉学" }, { "name": "护理学" }, { "name": "药学" },
            { "name": "临床医学" }, { "name": "中药学" }, { "name": "药理学" }, { "name": "放射医学" }, { "name": "生物医学" }, { "name": "眼视力学" }]
    },
    {
        "name": "经济与管理学院",
        "next": [{ "name": "会计学" }, { "name": "财务管理" }, { "name": "财务会计" }, { "name": "人力资源管理" }, { "name": "电子商务" }, { "name": "审计" },
            { "name": "市场营销" }, { "name": "物流管理" }, { "name": "旅游管理" }, { "name": "工商管理" }, { "name": "国际金融" }, { "name": "财务与预算" }]
    },
    {
        "name": "外语系",
        "next": [{ "name": "日语" }, { "name": "韩语" }, { "name": "英语" }, { "name": "德语" }, { "name": "俄语" }, { "name": "西班牙语" },
        { "name": "泰语" }, { "name": "意大利语" }, { "name": "印地语" }, { "name": "阿拉伯语" }, { "name": "马来语" }, { "name": "葡萄牙语" }]
    },
    {
        "name": "电气工程学院",
        "next": [{ "name": "电力系统及其自动化" }, { "name": "高电压与绝缘技术" }, { "name": "电力电子" }, { "name": "电力传动" }, { "name": "电工学" }, { "name": "电机学" },
            { "name": "高电压技术" }, { "name": "微机控制技术" }, { "name": "电力系统分析" }, { "name": "绝缘技术" }, { "name": "电力系统" }]
    },
    {
        "name": "机械工程学院",
        "next": [{ "name": "机械设计" }, { "name": "机械自动化" }, { "name": "材料成型" }, { "name": "控制工程" }, { "name": "过程装备" }, { "name": "车辆工程" },
        { "name": "机器人" }, { "name": "铁路机械设计" }, { "name": "机械电子" }, { "name": "轮机工程" }, { "name": "机电一体化" }, { "name": "精密制造" }]
    },
    {
        "name": "理学院",
        "next": [{ "name": "数学系" }, { "name": "概率与统计" }, { "name": "金融数学" }, { "name": "信息与计算科学" }, { "name": "工程计算" }, { "name": "精算中心" },
        { "name": "天体物理" }, { "name": "核物理" }, { "name": "凝聚态物理" }, { "name": "超导物理" }, { "name": "现代光学" }, { "name": "重离子物理" }]
    },
    {
        "name": "化工学院",
        "next": [{ "name": "控制工程" }, { "name": "应用化学" }, { "name": "催化化学" }, { "name": "高分子材料" }, { "name": "纳米材料" }, { "name": "无机化学" },
        { "name": "核磁中心" }, { "name": "合成实验室" }, { "name": "生物化学" }, { "name": "有机化学" }, { "name": "物理化学" }, { "name": "分析化学" }]
    },
    {
        "name": "人文学院",
        "next": [{ "name": "汉语言" }, { "name": "近代史" }, { "name": "古代历史" }, { "name": "考古学院" }, { "name": "陶瓷学院" }, { "name": "工业设计" },
        { "name": "对外汉语" }, { "name": "哲学系" }, { "name": "戏剧" }, { "name": "歌剧" }, { "name": "雕塑" }, { "name": "绘画学院" }]
    },
    {
        "name": "建筑学院",
        "next": [{ "name": "土木工程" }, { "name": "建筑设计" }, { "name": "景观设计" }, { "name": "建筑力学" }, { "name": "建筑材料学" }, { "name": "城市规划" },
        { "name": "城乡规划" }, { "name": "美学建筑" }, { "name": "桥梁设计" }, { "name": "港口设计" }, { "name": "道路设计" }, { "name": "地下建筑" }]
    },
    {
        "name": "社会科学学院",
        "next": [{ "name": "国际关系" }, { "name": "法学" }, { "name": "马克思主义学院" }, { "name": "体育学部" }, { "name": "政府管理" }, { "name": "信息管理" },
        { "name": "教育学" }, { "name": "新闻学" }, { "name": "传媒艺术" }, { "name": "社会学" }, { "name": "人类学" }, { "name": "军事学" }]
    }
    

];

var facultyLastLevel = ['陈云教授','刘忠副教授','张合教授','李白教授','杨敏副教授','金红研究员','赵曦教授','樊城教授','朱敏助研','何浪教授','刘梅教授','范庆斌副教授','徐建波教授','张建峰教授','刘鹏研究员','于敏芳研究员','陆之风研究员','郭洪波教授','高建民助研','张金兰教授','向金明副教授','付红兵教授','张德祥教授'];